docs/finance/FundAnalysis.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-09 Mon 09:57 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="weiwu" />
<link rel="stylesheet" type="text/css" href="../styles/demo/css/demo.css"/>
<link href="https://fonts.proxy.ustclug.org/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline13">1. Basics</a>
<ul>
<li><a href="#orgheadline1">1.1. Holding Based Approach(HBA)</a></li>
<li><a href="#orgheadline5">1.2. Return Based Analysis(ABA)</a>
<ul>
<li><a href="#orgheadline4">1.2.1. Fama-French 3 factors model</a></li>
</ul>
</li>
<li><a href="#orgheadline12">1.3. 中性策略</a>
<ul>
<li><a href="#orgheadline6">1.3.1. 中性策略根据实现手段可分为贝塔中性、市值中性和行业中性。</a></li>
<li><a href="#orgheadline7">1.3.2. How to Build a Sector-Neutral Stock Portfolio</a></li>
<li><a href="#orgheadline8">1.3.3. A pure growth and value portfolio skews sector allocations most at IT, energy and consumer discretionary.</a></li>
<li><a href="#orgheadline11">1.3.4. Steps:</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>



<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13"><span class="section-number-2">1</span> Basics</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> Holding Based Approach(HBA)</h3>
<div class="outline-text-3" id="text-1-1">
<p>
\[h=S\beta+\mu\]
</p>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">1.2</span> Return Based Analysis(ABA)</h3>
<div class="outline-text-3" id="text-1-2">
<p>
将基金历史收益与某些可观测的风格因素联系起来做回归分析，将各个因素的回归系数作为基金风格的测度.
</p>
</div>
<div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4"><span class="section-number-4">1.2.1</span> Fama-French 3 factors model</h4>
<div class="outline-text-4" id="text-1-2-1">
</div><ol class="org-ol"><li><a id="orgheadline2"></a>按照“价值—成长”定位分为：价值型、平衡型、成长型。价值型基金是为了通过购买股票获得当期收益，即通过上市公司分红而获得收益；成长型基金是购买当期被低估的股票，为了获得资本增值，等待价格上涨带来的收益；平衡型基金则既要获得当期收益，同样要获得资本增值。<br  /></li>
<li><a id="orgheadline3"></a>按照投资股票规模大小来区分：大盘型、中盘型、小盘型。简而言之，基金投资于大盘、中盘、小盘股，那么该基金的基金风格就是对应的大盘基金、中盘基金、小盘基金。<br  /></li></ol>
</div>
</div>
<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">1.3</span> 中性策略</h3>
<div class="outline-text-3" id="text-1-3">
<p>
中性策略就是构建投资组合，使得组合与市场之间相关系数为0，也就是投资组合不随市场的波动而波动。
</p>
</div>
<div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6"><span class="section-number-4">1.3.1</span> 中性策略根据实现手段可分为贝塔中性、市值中性和行业中性。</h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li>贝塔中性是指投资组合的贝塔值为0。</li>
<li>市值中性是指组合中多头部位中大、中、小盘股票的配比与空头部位指数的配比一致，做到市值中性不一定能实现贝塔中性，例如多头选一篮子创业板股票，空头用同市值的沪深300股指期货对冲，显然空头头寸无法覆盖多头头寸全部的风险敞口。</li>
<li>行业中性是指多头头寸与空头头寸行业板块配置一致，没有偏配，一般做到市值中性与行业中性的组合可以近似认为达到贝塔中性。A market-neutral strategy is a type of investment strategy undertaken by an investor or an investment manager that seeks to profit from both increasing and decreasing prices in one or more markets, while attempting to completely avoid some specific form of market risk. Market-neutral strategies are often attained by taking matching long and short positions in different stocks to increase the return from making good stock selections and decreasing the return from broad market movements.</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-4">
<h4 id="orgheadline7"><span class="section-number-4">1.3.2</span> How to Build a Sector-Neutral Stock Portfolio</h4>
<div class="outline-text-4" id="text-1-3-2">
<ul class="org-ul">
<li>Regardless of your investing style, you may not realize that if you focus on a particular type of stock, you could be creating an undiversified portfolio and taking unintended sector risk.</li>
<li>We believe most investors should try to build a "sector-neutral" portfolio when implementing their favorite stock-selection strategy.</li>
<li>sector neutrality won't typically result in much of a hit to your overall average returns, and you can still pick stocks using your favorite style.</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-4">
<h4 id="orgheadline8"><span class="section-number-4">1.3.3</span> A pure growth and value portfolio skews sector allocations most at IT, energy and consumer discretionary.</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
The benchmark may have a different weight decomposition that have a underweight on some sector or overweight on other sectors.
</p>
</div>
</div>
<div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11"><span class="section-number-4">1.3.4</span> Steps:</h4>
<div class="outline-text-4" id="text-1-3-4">
</div><ol class="org-ol"><li><a id="orgheadline9"></a>First, the model ranks roughly 3,623  (by exposure signal)  stocks  within each sector;<br  /></li>
<li><a id="orgheadline10"></a>selecting stocks from sectors:<br  /><div class="outline-text-5" id="text-1-3-4-2">
<ul class="org-ul">
<li>在Pool里面的信号值[0, 1)代表该stock是否在benchmark里。由pool和benchmark我们能得到每只股票的行业分类，以及由他们之间交集得到的待选股票池。</li>
<li>1、把每个行业里面的股票按signal的信号强度(P(i,j),i:行业，j股票名)可以排序。</li>
<li>2、从每个行业里面按quantile从步骤1排序后的股票池里面选股票，得到两个结果，具体每个行业的股票（S(i,j)，i:行业，j股票名）和每个行业股票的数量N(i)。</li>
<li>3、利用benchmark的weight数据得到每个行业所占的权重W(i)。结果即为行业中性下每只股票的权重。</li>
<li>4、W(i)/N(i)等权重赋值到挑选出来的股票S(i,j)。</li>
<li>For example, let’s say you have $10,000 to invest, equally allocated to large and small cap stocks. Owning 40 stocks equally weighted means that you would hold $250 in each position ($10,000 divided by 40). If a sector's weight is 20% of the benchmark, then 20% of your portfolio, or $2,000, would be invested in that sector. Because you’re investing $500 in each stock, you would hold 4 stocks in this sector ($2,000 divided by $500). Since you have equally allocated your capital to large and small cap stocks, you would own 2 large and 2 small cap stocks.</li>
</ul>
</div></li></ol>
</div>
</div>
</div>
</div>
</body>
</html>
